> I think this looks good; let us know what the terraform plan looks like when you try to apply it! Well maybe let us know, it might be enormous and hard to copy/paste haha

@raaidbroad The copy-paste was too big for slack to handle so I'm adding it here. Let me know if you think it looks okay 😁 If so, I'll go ahead and merge and apply!

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.monster_infrastructure.module.command_center.google_service_account_iam_binding.encode_workload_identity_binding will be created
  + resource "google_service_account_iam_binding" "encode_workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:broad-dsp-monster-dev.svc.id.goog[encode/argo-runner]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.monster_infrastructure.module.encode.google_project_iam_member.command_center_argo_account_iam["bigquery.dataOwner"] will be created
  + resource "google_project_iam_member" "command_center_argo_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.monster_infrastructure.module.encode.google_project_iam_member.command_center_argo_account_iam["bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "command_center_argo_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.jobUser"
    }

  # module.monster_infrastructure.module.encode.google_project_iam_member.command_center_argo_account_iam["compute.viewer"] will be created
  + resource "google_project_iam_member" "command_center_argo_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/compute.viewer"
    }

  # module.monster_infrastructure.module.encode.google_project_iam_member.command_center_argo_account_iam["dataflow.developer"] will be created
  + resource "google_project_iam_member" "command_center_argo_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/dataflow.developer"
    }

  # module.monster_infrastructure.module.encode.google_service_account_iam_binding.dataflow_runner_user_binding will be created
  + resource "google_service_account_iam_binding" "dataflow_runner_user_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.monster_infrastructure.module.encode.google_storage_bucket.staging_storage will be created
  + resource "google_storage_bucket" "staging_storage" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + location           = "US"
      + name               = "broad-dsp-monster-encode-dev-staging-storage"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 14
              + matches_storage_class = []
              + with_state            = (known after apply)
            }
        }
    }

  # module.monster_infrastructure.module.encode.google_storage_bucket.temp_bucket will be created
  + resource "google_storage_bucket" "temp_bucket" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + location           = "US"
      + name               = "broad-dsp-monster-encode-dev-temp-storage"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 7
              + matches_storage_class = []
              + with_state            = (known after apply)
            }
        }
    }

  # module.monster_infrastructure.module.encode.google_storage_bucket_iam_member.command_center_argo_staging_bucket_iam will be created
  + resource "google_storage_bucket_iam_member" "command_center_argo_staging_bucket_iam" {
      + bucket = "broad-dsp-monster-encode-dev-staging-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.monster_infrastructure.module.encode.google_storage_bucket_iam_member.command_center_argo_temp_bucket_iam will be created
  + resource "google_storage_bucket_iam_member" "command_center_argo_temp_bucket_iam" {
      + bucket = "broad-dsp-monster-encode-dev-temp-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.monster_infrastructure.module.encode.google_storage_bucket_iam_member.staging_account_iam_reader will be created
  + resource "google_storage_bucket_iam_member" "staging_account_iam_reader" {
      + bucket = "broad-dsp-monster-encode-dev-staging-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

  # module.monster_infrastructure.module.encode.google_storage_bucket_iam_member.staging_bucket_runner_iam will be created
  + resource "google_storage_bucket_iam_member" "staging_bucket_runner_iam" {
      + bucket = "broad-dsp-monster-encode-dev-staging-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.monster_infrastructure.module.encode.google_storage_bucket_iam_member.temp_bucket_runner_iam will be created
  + resource "google_storage_bucket_iam_member" "temp_bucket_runner_iam" {
      + bucket = "broad-dsp-monster-encode-dev-temp-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.monster_infrastructure.module.command_center.module.encode_argo_runner_account.google_project_iam_member.sa_iam["container.developer"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/container.developer"
    }

  # module.monster_infrastructure.module.command_center.module.encode_argo_runner_account.google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "encode-argo-runner"
      + display_name = "Service account to run Encode's Argo workflow."
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.monster_infrastructure.module.command_center.module.encode_argo_runner_account.google_service_account_key.sa_key will be created
  + resource "google_service_account_key" "sa_key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.monster_infrastructure.module.command_center.module.encode_argo_runner_account.null_resource.sa_delay will be created
  + resource "null_resource" "sa_delay" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.monster_infrastructure.module.command_center.module.encode_argo_runner_account.vault_generic_secret.sa_secret will be created
  + resource "vault_generic_secret" "sa_secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/monster/dev/command-center/service-accounts/encode-argo-runner"
    }

  # module.monster_infrastructure.module.encode.module.dataflow_runner_account.google_project_iam_member.sa_iam["dataflow.worker"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/dataflow.worker"
    }

  # module.monster_infrastructure.module.encode.module.dataflow_runner_account.google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "dataflow-runner"
      + display_name = " Service account to run Dataflow jobs"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.monster_infrastructure.module.encode.module.dataflow_runner_account.google_service_account_key.sa_key will be created
  + resource "google_service_account_key" "sa_key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.monster_infrastructure.module.encode.module.dataflow_runner_account.null_resource.sa_delay will be created
  + resource "null_resource" "sa_delay" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.monster_infrastructure.module.encode.module.dataflow_runner_account.vault_generic_secret.sa_secret will be created
  + resource "vault_generic_secret" "sa_secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/monster/dev/processing-projects/encode/service-accounts/dataflow-runner"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.cloud_resource_manager will be created
  + resource "google_project_service" "cloud_resource_manager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.service_usage will be created
  + resource "google_project_service" "service_usage" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "serviceusage.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[0] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "compute.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[1] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "container.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[2] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "containerregistry.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[3] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "dataflow.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[4] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iam.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[5] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iamcredentials.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[6] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "logging.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[7] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "monitoring.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[8] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "replicapool.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[9] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "replicapoolupdater.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[10] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "resourceviews.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[11] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "runtimeconfig.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[12] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "stackdriver.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[13] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storage-api.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[14] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storage-component.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.enable_services.google_project_service.services[15] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "bigquery.googleapis.com"
    }

  # module.monster_infrastructure.module.encode.module.k8s_network.google_compute_address.nat_addresses[0] will be created
  + resource "google_compute_address" "nat_addresses" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "monster-processing-network-nat-0"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.monster_infrastructure.module.encode.module.k8s_network.google_compute_address.nat_addresses[1] will be created
  + resource "google_compute_address" "nat_addresses" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "monster-processing-network-nat-1"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.monster_infrastructure.module.encode.module.k8s_network.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "monster-processing-network"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.monster_infrastructure.module.encode.module.k8s_network.google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "monster-processing-network-router"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode = "DEFAULT"
          + asn            = 64514
        }
    }

  # module.monster_infrastructure.module.encode.module.k8s_network.google_compute_router_nat.nat will be created
  + resource "google_compute_router_nat" "nat" {
      + icmp_idle_timeout_sec              = 30
      + id                                 = (known after apply)
      + name                               = "monster-processing-network-nat"
      + nat_ip_allocate_option             = "MANUAL_ONLY"
      + nat_ips                            = (known after apply)
      + project                            = (known after apply)
      + region                             = (known after apply)
      + router                             = "monster-processing-network-router"
      + source_subnetwork_ip_ranges_to_nat = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec   = 1200
      + tcp_transitory_idle_timeout_sec    = 30
      + udp_idle_timeout_sec               = 30
    }

  # module.monster_infrastructure.module.encode.module.k8s_network.google_compute_subnetwork.subnetworks[0] will be created
  + resource "google_compute_subnetwork" "subnetworks" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.0.0.0/22"
      + name                     = "monster-processing-network"
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = (known after apply)
      + purpose                  = (known after apply)
      + region                   = (known after apply)
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)
    }

Plan: 47 to add, 0 to change, 0 to destroy.
```